[{"weapon":"Blade","ability":"Spirit Blade (Basic)","castTime":0,"cooldown":0,"coeff":0.608,"text":"When your Spirit Blade is shattered:\r\nRequires and consumes 5 Chi.\r\nHarness your Chi to forge your Spirit Blade. Your next 10 Blade attacks deal an additional 29 physical damage.\r\n\r\nWhen your Spirit Blade is forged:\r\nRequires at least 1 Chi and consumes all Chi.\r\nGather your Chi to reforge your Spirit Blade, increasing the number of attacks remaining for your Spirit Blade. The number of attacks gained increases with the amount of Chi consumed. Note: All Chi is lost when your Spirit Blade shatters. [1/1/2/4/6 per Chi]\r\n\r\nThis ability does not trigger and is not affected by global recharge time.","passive":"Masterpiece","coeffPassove":0.77,"textPassive":"Your forging technique for your \"Spirit Blade\" is without blemish or imperfection, causing \"Spirit Blade\" to deal 17% more damage."},{"ability":"Spirit Blade (Hurricane)","castTime":0,"cooldown":0},{"ability":"Spirit Blade (Tsunami)","castTime":0,"cooldown":0,"coeff":1.038},{"ability":"Spirit Blade (Swallow Cut)","castTime":0,"cooldown":0,"coeff":1.121},{"ability":"Spirit Blade (Tempest)","castTime":0,"cooldown":0},{"ability":"Spirit Blade (Snake's Bite)\r\nSpirit Blade (Rushing River)\r\nSpirit Blade (Impale Spirit)","castTime":0,"cooldown":0},{"ability":"Flowing Strike","energy":0,"cooldown":0,"coeff":1.175,"text":"Your blade moves like flowing water, striking your target for 9 physical damage.\r\nRequires a Blade in your Primary Weapon slot","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Hurricane","energy":3,"cooldown":0,"text":"PBAoE: Affects up to 6 enemies in a 5 metre radius around you.Consumes 3 Blade Energy.\r\nYour blade cuts through the air creating gale force winds which deal 10 physical damage to nearby enemies.","passive":"Eye of the Storm","textPassive":"Your \"Hurricane\" rages around you, battering your foes with every other hit of this ability for an additional 3 physical damage."},{"ability":"Hone","energy":2,"cooldown":20,"text":"Hone your blade and spirit to gain 2 Blade Energy and cause your Blade attacks to have an additional 20% chance to generate Chi.\r\nThis ability does not trigger and is not affected by global recharge time.","passive":"Keen Edge","textPassive":"You \"Hone\" your blade to a razor sharp edge, increasing your Crit Power with Blade abilities while \"Hone\" is active by 40%."},{"ability":"Tsunami","energy":5,"castTime":2.5,"cooldown":0,"coeff":5.19,"text":"Channelled: Every 0.5 seconds for 2.5 seconds.Consumes 5 Blade Energy.\r\nMove as an unrelenting tsunami, drowning your target under the waves of your attacks, each dealing 8 physical damage.","passive":"Storm Surge","coeffPassove":6.130000000000001,"textPassive":"The waves of your \"Tsunami\" swell whenever Chi is generated, dealing an additional 4 physical damage to the target."},{"ability":"Soothing Spring","energy":2,"cooldown":20,"text":"Consumes 2 Blade Energy.\r\nYour energy replenishes you like a soothing spring. You are instantly healed for 11.5% of your health and cleansed of 1 detrimental effect. You also gain a beneficial effect which restores 1.5% of your health and cleanses 1 detrimental effect every 0.5 seconds for 6 seconds.\r\nThis ability does not trigger and is not affected by global recharge time.","passive":"Meditate","textPassive":"You meditate on the essence of a \"Soothing Spring.\" Each time the heal over time effect restores your health, you have an 18% chance to gain 1 Chi."},{"ability":"Snake's Bite","energy":2,"cooldown":20,"text":"Consumes 2 Blade Energy.\r\nStrike your target with the pommel of your blade, stunning them for 3 seconds. You immediately perform a follow up slash dealing 22 physical damage.","passive":"Reversal","textPassive":"Whenever you interrupt an enemy's attack with \"Snake's Bite\", you reverse the flow of harmful energy and gain 2 Chi. You also direct some of the energy back at your target dealing an additional 2 physical damage."},{"ability":"Rushing River","energy":2,"text":"Column Dash: Dash forward 10 metres, affecting up to 6 enemies in a 6 metre wide column along the way.Consumes 2 Blade Energy.\r\nRush through your enemies like the raging rapids dealing 10 physical damage and slowing their movement. Applies Exposed.","passive":"Waterfall","textPassive":"Your \"Rushing River\" cascades like a waterfall into a new flow. If you damage an enemy with \"Rushing River\" you are able to activate \"Rushing River\" a second time within 5 seconds. The damage of this second activation is increased to 26 physical damage."},{"ability":"Swallow Cut","energy":3,"castTime":0,"coeff":2.525,"text":"Consumes 3 Blade Energy.\r\nPerform a quick and precise strike with your blade dealing 19 physical damage.","passive":"Hardened Blade","coeffPassove":2.7074,"textPassive":"Your \"Swallow Cut\" tempers and hardens your Spirit Blade. Whenever you hit an enemy with \"Swallow Cut\" you have a 30% chance to not consume an attack from your Spirit Blade."},{"ability":"Crescent Fang","energy":0,"text":"PBAoE: Affects up to 6 enemies in a 5 metre radius around you.Cut a crescent-shaped arc in front of you with your blade dealing 5 physical damage to nearby enemies.\r\nRequires a Blade in your Primary Weapon slot.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Tempest","energy":5,"text":"PBAoE: Affects up to 6 enemies in a 5 metre radius around you.Consumes 5 Blade Energy.\r\nUnleash a storm of blades around you dealing 9 physical damage to nearby enemies. A whirling vortex is left in the wake of the blade-storm which deals 1 physical damage every 0.5 seconds for 5 seconds to enemies standing in the area.","passive":"Whirlwind","textPassive":"You harness the power of the wind while your \"Tempest\" blows furiously around you. While you are inside of the ground area of your \"Tempest\", your Blade attacks deal an additional 2 physical damage to the target and nearby enemies."},{"ability":"Impale Spirit","energy":2,"text":"Impale Spirit:\r\nConsumes 2 Blade Energy.\r\nImpale your target with a spirit-forged blade dealing 5 physical damage and slowing its movement. The wound left by the blade lingers on, dealing 3 physical damage every second for 5 seconds.\r\nThis ability has a 10 metre range. Becomes Exhume Spirit for 5 seconds on a successful hit.\r\nExhume Spirit:\r\nSlice the air in front of you creating a whirlwind that seeks out the enemy you had impaled. The whirlwind erupts into a violent maelstrom upon reaching its target dealing 7 physical damage to the target and nearby enemies. Applies Exposed.","passive":"Sunder Spirit","textPassive":"Your \"Exhume Spirit\" tears at the spirit energy of your foes, causing all affected enemies to be dealt 4 physical damage every second for 5 seconds."},{"ability":"Dancing Blade","energy":4,"castTime":2.5,"coeff":7.58,"text":"Channelled: Every 0.5 seconds for 2.5 seconds.Consumes 4 Blade Energy.\r\nYour blade dances through the air, cutting at your target's spirit dealing 7 physical damage. As you grasp your blade the dance comes to a deadly end, dealing 28 physical damage.\r\nThis ability has a 10 metre range.","passive":"Soulforged Blade","coeffPassove":10.49,"textPassive":"Your \"Dancing Blade\" harnesses your soul and the soul of your foe and coalesces into a Spirit Blade upon completion which lasts for 3 attacks. If you have already forged your Spirit Blade, the number of attacks remaining is increased by 3."},{"ability":"Supreme Harmony","energy":4,"castTime":0,"coeff":"-","text":"Consumes 4 Blade Energy.\r\nAchieve complete harmony of body, mind, spirit, and blade for 8 seconds. During this time all of your Blade attacks deal 23% more damage and restore 1.5% of your health. In addition, your movement speed is increased by 20%. Upon activation, you are cleansed of all detrimental effects and gain 2 Chi.\r\n\r\nThis ability does not trigger and is not affected by global recharge time.","passive":"Master's Focus","coeffPassove":"n/a","textPassive":"When you gain Chi, you focus your senses reducing the remaining recharge time of \"Supreme Harmony\" by 5%."},{"ability":"Typhoon","energy":4,"castTime":0,"coeff":1.28,"text":"PBAoE: Affects up to 6 enemies in a 5 metre radius around you.Consumes 4 Blade Energy.\r\nEmbody the destructive nature of a typhoon, lashing out at nearby targets with your blade dealing 10 physical damage and stunning them for 1 second.\r\nLike the crushing waves that follow a typhoon, you increase your Blade damage by 6% for each affected enemy, up to a maximum of 30%. This effect lasts 6 seconds.","passive":"Torrent","coeffPassove":"n/a","textPassive":"The waves of your \"Typhoon\" come crashing down on your foes with unrelenting force, increasing the damage bonus for each target hit by \"Typhoon\" to 9.3% up to a maximum of 46.5%."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Immortal Spirit","textPassive":"Whenever you gain Chi you replenish your spirit, restoring 1% of your health every second for 3 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Clairvoyance","textPassive":"You have sharpened your senses such that you are able to guard yourself preemptively from danger. Whenever you gain a heal over time effect from Chi Overflow, \"Soothing Spring\", or \"Immortal Spirit\" you also gain a barrier that absorbs 100% of incoming damage and dissipates after absorbing damage equal to 12.5% of your maximum health. This effect can only occur once every 10 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Deluge","textPassive":"Striking enemies with your Spirit Blade builds up power inside of your Blade. Every sixth hit with Spirit Blade active unleashes a flood of power around you dealing 3 physical damage to nearby enemies."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Sweeping Slice","coeffPassove":0.125,"textPassive":"You have learned techniques for handling multiple enemies with your Blade. Whenever you hit 2 or more enemies with a single Blade ability you deal an additional 2 physical damage to nearby enemies."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Draw Sword, Draw Blood","textPassive":"When you draw your Blade it thirsts to spill blood before being sheathed. Whenever you enter combat, your next 3 Blade attacks deal 20% more damage. While in combat, you gain 1 use of this bonus effect every 10 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Measure Twice, Cut Once","textPassive":"Each cut of your Blade is a measured and precise action. While in combat, if you have not generated Chi in the past 4.5 seconds, your next Blade attack will generate 1 Chi in addition to the normal Chi gain chance."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Focused Breathing","textPassive":"You slow your breathing and focus your mind while in combat allowing you to generate 1 Chi every 9 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Resonance","coeffPassove":0.38,"textPassive":"Your spirit resonates strongly with your Blade. Whenever you gain Chi, your next Blade attack deals an additional 3 physical damage."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Warrior's Spirit","coeffPassove":1.342,"textPassive":"Your unyielding warrior spirit endures on even as your Spirit Blade shatters. Whenever your Spirit Blade shatters, you gain 1 Chi and deal 5 physical damage to nearby enemies."},{"weapon":"Hammer","ability":"Rage (Razor Shards)","energy":"-","castTime":"-"},{"ability":"Rage (Demolish)","energy":"-","castTime":"-","coeff":8.37,"text":"consume 50 rage to do +4.94CP","coeffPassove":9.625499999999997},{"ability":"Rage (Pulverise)","energy":"-","castTime":"-"},{"ability":"Rage (Burning Wrath)","energy":"-","castTime":"-"},{"ability":"Rage (Eruption)","energy":"-","castTime":"-"},{"ability":"Smash","energy":0,"castTime":0,"coeff":1.175,"text":"Strike quickly with your hammer dealing 9 physical damage.\r\nGenerates 5 Rage.\r\n\r\nRequires a Hammer in your Primary Weapon slot.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Razor Shards","energy":3,"castTime":0,"text":"PBAoE: Affects up to 6 enemies in a 5 metre radius around you.Consumes 3 Hammer Energy.\r\nSlam the ground with your hammer, sending razor sharp shards of earth flying in all directions dealing 10 physical damage.\r\nGenerates 6 Rage per target hit.\r\n\r\nWhen Enraged: Shatter the earth beneath you making larger shards impale affected enemies causing them to take 7 physical damage every second for 5 seconds. Instead of generating Rage, this attack consumes 50 Rage.","passive":"Shatter","textPassive":"Each time you use \"Razor Shards\" you gather your strength, increasing the power of the next \"Razor Shards\" by 6%. This effect can stack up to 5 times."},{"ability":"Seethe","castTime":0,"text":"Focus your anger to gain 4 Hammer Energy. This ability does not trigger and is not affected by global recharge time.","passive":"Outrage","textPassive":"Using \"Seethe\" causes your Rage to spill over, generating 38 Rage."},{"ability":"Demolish","energy":5,"castTime":0,"coeff":3.425,"text":"Consumes 5 Hammer Energy.\r\nCrush your target with the full weight of your hammer dealing 25 physical damage.\r\nGenerates 25 Rage.\r\n\r\nWhen Enraged: Unleash your anger on your target improving the damage dealt to 61 phyiscal damage. Instead of generating Rage, this attack consumes 50 Rage.","passive":"Obliterate","coeffPassove":3.938749999999999,"textPassive":"Your critical hits with \"Demolish\" are brutally devastating, dealing 30% more damage."},{"ability":"Pain Suppression","energy":2,"castTime":0,"text":"Consumes 2 Hammer Energy.\r\nYour anger allows you to fight through the pain for the next 8 seconds. During this time, whenever you are hit, you fight on and heal yourself for 50% of the damage dealt. In addition, you get even angrier when hit, generating 2 extra Rage. This ability does not trigger and is not affected by global recharge time.","passive":"No Pain, No Gain","textPassive":"You embrace pain, growing stronger from it. While \"Pain Suppression\" is active, enemy attacks heal you for 113% of the damage they deal."},{"ability":"Enter the Fray","energy":2,"castTime":0,"text":"Charge: 15 metre charge to the target. The target must be at least 3 metres away.Consumes 2 Hammer Energy.\r\nEnter the heat of battle by charging to the target, dealing 15 physical damage. For the next 6 seconds, enemies within 5 metres of the target are compelled to attack you. Whenever you are hit, you strike back dealing 2 physical damage to the attacker.\r\nGenerates 10 Rage.","passive":"Brawler","textPassive":"You are experienced in brawls. The reactive damage dealt by \"Enter the Fray\" is increased to 2 physical damage and you and allies near the target gain 10000 Protection for 6 seconds."},{"ability":"Rampage","energy":2,"castTime":0,"coeff":0.63,"text":"PBAoE: Affects up to 6 enemies in a 5 metre radius around you.Consumes 2 Hammer Energy.\r\nFuriously lash out at nearby enemies dealing 5 physical damage. Applies Exposed.\r\nGenerates 9 Rage per target hit.","passive":"Let Loose","coeffPassove":0.7245,"textPassive":"Your rage surges when you go on a \"Rampage.\" If using \"Rampage\" causes you to become Enraged, the base damage of your next Rage spending ability is increased by:\r\n   • Razor Shards: 200%\r\n   • Demolish: 30%\r\n   • Pulverise: 100%\r\n   • Burning Wrath: 160%\r\n   • Eruption with Annihilate Passive: 20%"},{"ability":"Thick Skin","energy":2,"castTime":0,"text":"Consumes 2 Hammer Energy.\r\nHarden yourself against incoming blows, increasing your Protection by 14200 for 10 seconds. Applies Debilitated to any attackers. This ability does not trigger and is not affected by global recharge time.","passive":"Rock Hard","textPassive":"Your rage shields you from harm. When using \"Thick Skin\" you also gain a damage absorbing barrier for 5 seconds. This barrier absorbs damage up to 150% of your maximum health."},{"ability":"Pulverise","energy":3,"castTime":0,"text":"Consumes 3 Hammer Energy.\r\nBash your target with a backhand swing of your hammer dealing 19 physical damage. This attack generates a large amount of hate.\r\nGenerates 18 Rage.\r\n\r\nWhen Enraged: Harness your rage to strengthen yourself increasing your maximum health by 30% for 15 seconds. Instead of generating Rage, this attack consumes 50 Rage.","passive":"Percussive Maintenance","textPassive":"Your Rage fueled blows from \"Pulverise\" provide you a degree of comfort. When refreshing the duration of the maximum health bonus of \"Pulverise\" you also heal yourself for 6% of your maximum health."},{"ability":"Ground Pound","energy":0,"castTime":0,"text":"PBAoE: Affects up to 6 enemies in a 5 metre radius around you.Strike the ground with your hammer, sending out shockwaves which deal 5 physical damage. This attack generates a large amount of hate.\r\nGenerates 2 Rage per target hit.\r\n\r\nRequires a Hammer in your Primary Weapon slot.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Burning Wrath","energy":5,"castTime":0,"text":"PBAoE: Affects up to 6 enemies in a 5 metre radius around you and also pulsing every 0.5 seconds for 5 seconds.Consumes 5 Hammer Energy.\r\nManifest your fiery rage dealing 12 physical damage. For the next 5 seconds your rage burns nearby enemies dealing 1 physical damage. This attack generates a large amount of hate.\r\nGenerates 8 Rage per target hit by the initial blast.\r\n\r\nWhen Enraged: Your unbridled rage sunders the earth beneath you leaving a damaging area on the ground. Enemies standing in this area have their movement speed slowed and are dealt 4 physical damage every 0.5 seconds for 5 seconds. Instead of generating Rage, this attack consumes 50 Rage.","passive":"Animosity","textPassive":"Your \"Burning Wrath\" bolsters your defenses, granting 140 Protection per target hit by the initial blast of rage for 6 seconds. This effect can stack up to 10 times. In addition, the pulsing damage generates increased hate."},{"ability":"Blindside","energy":2,"castTime":0,"text":"Shove your target to the ground, purging 1 beneficial effect from them and dealing 19 physical damage.\r\nGenerates 10 Rage.","passive":"Beatdown","textPassive":"When your \"Blindside\" ability successfully interrupts a target, you mark the target to get a beatdown for 6 seconds. Every time the target is hit by you or any of your allies, they have a 75% chance to generate 1 energy for the weapon they used."},{"ability":"Eruption","energy":4,"castTime":0,"coeff":5.6,"text":"Column: Affects up to 6 enemies in a 6 metre wide by 9 metre long area in front of you.Consumes 4 Hammer Energy.\r\nYou smash your hammer into the ground, creating a column of molten ground in front of you that sends enemies into the air, purges 1 beneficial effect, and deals 41 physical damage. Applies Exposed.\r\nGenerates 7 Rage per target hit.","passive":"Annihilate","coeffPassove":12.72,"textPassive":"Your Rage knows no limits. When Enraged, \"Eruption\" will no longer generate Rage. Instead it will spend 50 Rage and increase the damage dealt to 93 physical damage."},{"ability":"Unstoppable Force","energy":4,"castTime":0,"coeff":"n/a","text":"Become an unstoppable machine of destruction. Grow in size by 25%, deal 20% more damage with Hammer abilities, and generate 3 Rage every second for 8 seconds.\r\n\r\nWhen activated all action and movement restricting effects are removed and you are immune to them for the duration of the effect. This ability does not trigger and is not affected by global recharge time.","passive":"Juggernaut","coeffPassove":"n/a","textPassive":"Become a hulking Juggernaut. While \"Unstoppable Force\" is active, you take 38% less damage."},{"ability":"Raging Volcano","energy":4,"castTime":6,"coeff":8.46,"text":"Channelled: Every 0.5 seconds for 6 seconds.\r\nPBAoE: Affects up to 6 enemies in a 5 metre radius around you.Consumes 4 Hammer Energy.\r\nBecome a fiery whirlwind of destruction dealing 18 physical damage per hit while forcing nearby enemies to attack you and slowing their movement. The last hit will deal 17 physical damage and apply Debilitated.\r\nWhile channelling this ability, you take 20% less damage and your movement speed is increased by 30%.\r\nGenerates 4 Rage per target hit.","passive":"Molten Armor","coeffPassove":"n/a","textPassive":"Clad yourself with molten armor as you damage enemies with \"Raging Volcano\" for 10 seconds. While your armor endures, you take 20% less damage. Taking damage in excess of 2% of your maximum health chips away at the armor."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Forged in Fire","textPassive":"Whenever you take damage when enraged and below 50% health, you fight through the pain and heal yourself for 5% of your maximum health every second for 5 seconds. This can only occur once every 20 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Unbridled Wrath","textPassive":"Your wrath empowers your attacks even further. The power of your Enrage bonus effects is increased:\r\n   • Razor Shards damage over time: 15%\r\n   • Demolish damage: 8%\r\n   • Pulverise new maximum health bonus: 35%\r\n   • Burning Wrath ground area damage: 14%\r\n   • Eruption damage with Annihilate Passive: 5.5%"},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Fast and Furious","textPassive":"Spurred on by your rage, you gain 25% movement speed and 9% increased damage with Hammer attacks for 3.5 seconds after becoming Enraged."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Berserker","textPassive":"Your critical hits with Hammer abilities cause a surge of Rage, granting you 4 extra Rage."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Blunt Force Trauma","textPassive":"Repeated blows with your Hammer set you up for a devastating finish. After attacking 4 times with Hammer abilities, you gain 10% increased critical damage with Hammer abilities for 3 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Bullheaded","textPassive":"The feeble attacks of your enemies infuriate you. Whenever you are attacked and the damage dealt is less than 7% of your maximum health, you generate 2 additional Rage."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Bristling Rage","textPassive":"Whenever you are hit, your Rage lashes out at the attacker, damaging them. The amount of damage dealt increases based on your current Rage level. At 30 Rage, the damage dealt is 1 physical damage."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Anger Management","textPassive":"You learn to control your anger and let it spill forth at the right time. Whenever you use a Hammer consumer, your next Hammer consumer generates 2 extra Rage for every second, up to a maximum of 5, you waited after using your first Hammer consumer."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Die Hard","textPassive":"Your Rage helps you fight through grievous wounds. Whenever you drop below 35% health, you gain 25000 Protection. While this effect is active, you lose 10 Rage per second. This effect expires when you run out of Rage. If you have less than 20 Rage when this effect triggers, your current Rage is set to 20."},{"weapon":"Fist","ability":"Frenzied Wrath (Ravage)","energy":0,"castTime":0,"coeff":3.9800000000000004,"text":"Tap into your Fury to enter a state of unbridled wrath for a short time and cleanse 2 detrimental effects from yourself. During this time your entire ability bar is changed into a set of new abilities. This ability does not trigger and is not affected by global recharge time. Requires at least 60 Fury to activate.\r\n\r\nRavage: (Default [LMB])\r\nTear flesh from bone causing horrific wounds dealing 10 physical damage and 5 physical damage every second for 5 seconds.\r\n\r\nShred: (Default [RMB])\r\nYour razor sharp claws shred nearby enemies dealing 8 physical damage and 1 physical damage every second for 5 seconds. If the target has the \"Maim\" effect active, nearby enemies are dealt an additional 4 physical damage.\r\n\r\nMaim: (Default [E])\r\nConsumes 4 Fist Weapon Energy.\r\nTear open wounds on your target dealing 2 physical damage and 3 physical damage every second for 15 seconds.","passive":"Gore","textPassive":"Your control over your Wrath grants you access to a new ability when you are using \"Frenzied Wrath.\"\r\n\r\nGore: (Default [1])\r\nCharge: 15 metre charge to your target. The target must be at least 1 metre away.You charge to your target and impale them with your claws dealing 9 physical damage to up to 6 enemies in a 5 metre radius as you arrive. The target and nearby enemies are left bleeding for 3 physical damage every 0.5 seconds for 5 seconds."},{"ability":"Frenzied Wrath (Shred)","energy":0,"castTime":0,"coeff":3.1799999999999997},{"ability":"Frenzied Wrath (Maim)","energy":4,"castTime":0,"coeff":6.002000000000001},{"ability":"Invigorating Wrath (Revitalise)","energy":0,"castTime":0,"text":"Tap into your Fury to enter a state of reinvigoration for a short time and cleanse 2 detrimental effects from yourself. During this time your entire ability bar is changed into a set of new abilities. This ability does not trigger and is not affected by global recharge time. Requires at least 60 Fury to activate.\r\n\r\nRevitalise: (Default [LMB])\r\nMend the wounds of your group members, restoring 1 health.\r\n\r\nInvigorate: (Default [RMB])\r\nYour fury invigorates your group members, restoring 1 health.\r\n\r\nRevivify: (Default [E])\r\nConsumes 4 Fist Weapon Energy.\r\nHarness the natural restorative power around you and your group members healing them for 1 every second for 6 seconds.","passive":"Serenity","textPassive":"Your control over your Wrath grants you access to a new ability when you are using \"Invigorating Wrath.\"\r\nSerenity: (Default [1])\r\nA sense of calm washes of you, relieving you of your Fury and channeling it towards restoring your target. You spend all of your remaining Fury to heal an ally for 0 plus 0 more for every point of Fury spent."},{"ability":"Invigorating Wrath (Invigorate)","energy":0,"castTime":0},{"ability":"Invigorating Wrath (Revivify)","energy":4,"castTime":0},{"ability":"Thrash","castTime":0,"coeff":1.175,"text":"Lash out at your target with your claws, striking 2 times for 4 physical damage.\r\nGenerates 2 Fury per hit.\r\nRequires a Fist Weapon in your Primary Weapon slot.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Savage Sweep","castTime":0,"text":"PBAoE: Affects up to 6 enemies in a 5 metre radius around you.Consumes 3 Fist Weapon Energy.\r\nRip and tear at nearby enemies dealing 10 physical damage.\r\nGenerates 3 Fury per target hit.","passive":"Rip","textPassive":"Your \"Savage Sweep\" rips jagged wounds into the flesh of your enemies causing them to bleed for 1 physical damage every second for 5 seconds."},{"ability":"Mangle","energy":5,"castTime":0,"coeff":3.425,"text":"Consumes 5 Fist Weapon Energy.\r\nMutilate your target with a series of 3 strikes with your claws dealing 9 physical damage per hit. Generates 4 Fury per hit.","passive":"Maul","coeffPassove":4.0249999999999995,"textPassive":"Your \"Mangle\" tears open wounds in your target that do not close quickly causing 1 physical damage every second for 5 seconds."},{"ability":"Eviscerate","castTime":0,"coeff":2.7,"text":"Consumes 2 Fist Weapon Energy.\r\nImpale your target with your claws and tear at their insides dealing 20 physical damage and stunning them for 3 seconds. Applies Exposed.\r\nIf this ability successfully interrupts a target, you and your group members are healed for 1 every second for 5 seconds.\r\nGenerates 3 Fury.","passive":"Bloodbath","textPassive":"When you \"Eviscerate\" enemies you take advantage of any opening, bolstering your allies and leaving the target maimed. If \"Eviscerate\" successfully interrupts an enemy it deals an additional 3 physical damage every second for 5 seconds. Your allies are inspired by the bloodshed, increasing the per second healing amount to 1."},{"ability":"Ferocity","castTime":0,"coeff":2.9,"text":"Consumes 2 Fist Weapon Energy.\r\nUnleash your ferociousness and empower your next Fist Weapon attack or healing ability. This ability does not trigger and is not affected by global recharge time.\r\nYour next Fist Weapon attack will remove all Fist Weapon damage over time effects from your target and cause them to immediately deal their remaining damage to the target plus an additional 22 physical damage.\r\nYour next Fist Weapon healing ability will remove all Fist Weapon heal over time effects from your defensive target and cause them to immediately heal for their remaining healing plus an additional 20.\r\nGenerates 3 Fury.","passive":"Brutality","coeffPassove":5.4,"textPassive":"Your brutal \"Ferocity\" leaves its mark on your allies and enemies alike. If \"Ferocity\" is used in conjunction with damage over time effects, the target is dealt an additional 4 physical damage every second for 5 seconds.\r\n\r\nIf \"Ferocity\" is used in conjunction with heal over time effects, the target is healed for an additional 1 every second for 5 seconds."},{"ability":"Wild Surge","castTime":0,"text":"Consumes 2 Fist Weapon Energy.\r\nCreate a surge of wild power at the targeted point that lasts 10 seconds. Every second it restores 1 health and cleanses 1 detrimental effect from allies in the area and deals 1 physical damage to enemies in the area. Enemies hit will also have their movement slowed.\r\nGenerates 3 Fury.","passive":"Wild Burst","textPassive":"The untamed power of your \"Wild Surge\" bursts with a final surge of power when it expires. When the ground area effect of \"Wild Surge\" terminates, allies are healed for up to 0 based on the length of time they spent in the area.\r\n\r\nLikewise, enemies are dealt up to 19 physical damage, based on the length of time they spent in the area."},{"ability":"Savagery","castTime":0,"text":"Consumes 2 Fist Weapon Energy.\r\nDraw out the inner savage nature of your defensive target, increasing the strength of their attacks and healing effects by 15% for 6 seconds. This ability does not trigger and is not affected by global recharge time.\r\nGenerates 8 Fury.","passive":"Furious Inspiration","textPassive":"The ferocious nature of your \"Savagery\" provides further inspiration. Whenever the target of your \"Savagery\" effect deals damage, they are healed for 1 and you gain 3 Fury."},{"ability":"Renewal","castTime":0,"text":"Consumes 3 Fist Weapon Energy.\r\nCall forth a resurgence of vigour which heals your defensive target 3 times for 5.\r\nGenerates 9 Fury.","passive":"Recuperate","textPassive":"The restorative power of your \"Renewal\" allows allies to recover more from your further healing effects. After healing an ally with \"Renewal\" any additional healing effects on that ally from you will heal for an additional 1. This effect lasts for 3 seconds."},{"ability":"Nurture","castTime":0,"text":"Your restorative power seeks out and heals the member of your group with the lowest percentage remaining health for 7 and gives them a heal over time effect that heals for 1 every second for 3 seconds. The heal over time effect can stack up to 3 times. Generates 3 Fury.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Feral Regrowth","castTime":0,"text":"Consumes 5 Fist Weapon Energy.\r\nCall forth the natural recuperative forces in your defensive target, healing them for 2 and for an additional 3 every second for 6 seconds.\r\nGenerates 12 Fury.","passive":"Outgrowth","textPassive":"The regenerative force of your \"Feral Regrowth\" extends to nearby injured allies. Whenever \"Feral Regrowth\" expires for any reason, the lowest health ally nearby is healed for 1 every second for 3 seconds."},{"ability":"Berserk","energy":4,"castTime":2.5,"coeff":7.1,"text":"Channelled: Every 0.25 seconds for 2.5 seconds.Consumes 4 Fist Weapon Energy.\r\nFly into a berserk rage and unleash a flurry of attacks that deal 6 physical damage per hit. Applies Exposed.\r\nWhile channelling, you and your target are rooted to the ground and unable to move.\r\nGenerates 2 Fury per hit.","passive":"Rampage","coeffPassove":9.5,"textPassive":"Your \"Berserk\" fury crushes and destroys whomever you set your sights on. When you activate \"Berserk\" the target is additionally stunned for 5 seconds and the damage dealt is increased to 7 physical damage per hit if the target has one of your Fist Weapon damage over time effects active."},{"ability":"Primal Instinct","energy":4,"castTime":0,"coeff":12.389999999999999,"text":"Consumes 4 Fist Weapon Energy.\r\nGive in to your animal instict for a short time, allowing you to both mend and destroy more effictively. For the next 6 seconds, all of your Fist Weapon heal over time and damage over time effects are 100% more powerful. This bonus is reduced to 50% when detonating these effects. This ability does not trigger and is not affected by global recharge time.\r\nGenerates 18 Fury.","passive":"Killer Instinct","coeffPassove":"n/a","textPassive":"Your \"Primal Instinct\" is honed with razor sharp purpose. While \"Primal Instinct\" is active all of your heal over time and damage over time effects have 50% more Crit Power."},{"ability":"Regeneration","energy":4,"castTime":0,"coeff":5.8100000000000005,"text":"Consumes 4 Fist Weapon Energy.\r\nCause the wounds suffered by you and your group members to seal up and mend, restoring 16 health and cleansing 2 detrimental effects. The mending process continues afterward, restoring 6 health every second for 4 seconds.Generates 18 Fury.","passive":"Natural Remedy","coeffPassove":7.8100000000000005,"textPassive":"You infuse your \"Regeneration\" with natural energies, increasing the intial healing amount to 17. In addition, any overhealing done to any group member is redirected to the group member with the lowest health."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Vigour","textPassive":"Your fury fills you with renewed vigour. Whenever you activate a Fist Weapon ability, you have a 20% chance to restore 2% of your health every second for 3 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Furor","textPassive":"You work yourself into a frenzy with repeated ability uses. Whenever you use 3 Fist Weapon Power Abilities in succession you gain an additional 3 Fury."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Second Wind","textPassive":"As your wrath subsides, you take a breather and gather your strength. Whenever a \"Frenzied Wrath\" or \"Invigorating Wrath\" effect ends, you gain 4 Fist Weapon Energy."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Smell Fear","textPassive":"Your keen senses allow you to sense fear in the hearts of enemies around you. Whenever you enter combat and every 8 seconds afterward you sense fear in a nearby enemy. Hitting this enemy with a Fist Weapon Power Ability generates 8 Fury."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Bloody Mist","coeffPassove":0.25,"textPassive":"Your critical hits result in a savage spray of blood. Whenever you critically hit with a Fist Weapon ability, you deal an additional 2 physical damage."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Warmth","textPassive":"Your heals have a warm afterglow which aids in the recovery process. Whenever you heal with a single target Fist Weapon Ability, you heal for an additional 1. This effect lasts 2 seconds and can stack up to 5 times."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Potent Wrath","textPassive":"Your wrath ends with an surge of power. Whenever your \"Frenzied Wrath\" effect ends, nearby enemies are dealt 2 physical damage every second for 5 seconds.\r\nWhenever your \"Invigorating Wrath\" effect ends all of your group members are healed for 1 every second for 5 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Keen Senses","coeffPassove":0.25,"textPassive":"You are able to sense the weaknesses in both allies and enemies, knowing just how to help and harm effectively. Whenever you heal an ally who is below 35% health with a Fist Weapon ability, you heal for an additional 1.\r\nWhenever you damage an enemy who is below 35% health with a Fist Weapon ability you deal an additional 2 physical damage."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Wild Nature","textPassive":"Your embody the wild and ferocious side of nature, fueling your Fury. While in combat, you gain 1 Fury every second."},{"weapon":"Blood","ability":"Blood Offering (0-10 Corruption)","energy":"-","castTime":"-","text":"no additional damage"},{"ability":"Blood Offering (11-60 Corruption)","energy":"-","castTime":"-","text":"x1.156 damage, x0.80 healing"},{"ability":"Blood Offering (61-90 Corruption)","energy":"-","castTime":"-","text":"x1.327 damage, x0.50 healing"},{"ability":"Blood Offering (91-100 Corruption)","energy":"-","castTime":"-","text":"x1.534 damage, x0.05 healing"},{"ability":"Torment","coeff":1.175,"text":"Invoke a ritual of pain on your target dealing 9 magical damage.\r\nIncreases your Corruption level by 2.\r\nRequires a Blood Magic Focus in your Primary Weapon slot.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Dread Sigil","text":"TAoE: Affects 6 enemies in a 5 metre radius around the target.Consumes 3 Blood Magic Energy.\r\nEtch a blood-forged sigil of dread on the ground underneath your target dealing 10 magical damage to the target and nearby enemies.\r\nIncreases your Corruption level by 8.","passive":"Lingering Curse","textPassive":"The effects of your \"Dread Sigil\" linger, cursing affected targets by dealing 1 magical damage every second for 5 seconds."},{"ability":"Reap","castTime":1,"coeff":2.1,"text":"Consumes 2 Blood Magic Energy.\r\nReplenish yourself by feasting on a flood of power from your target. The target is left bleeding, causing 2 magical damage every second for 7 seconds. The stolen power restores 25% of your missing health and cleanses you of 1 detrimental effect.\r\nYour Corruption level must be higher than 10 to use this ability.\r\nReduces your Corruption level by 50.","passive":"Contaminate","coeffPassove":4.8999999999999995,"textPassive":"When you \"Reap\" enemies you infuse them with your Corruption, causing the damage over time effect to increase to 3 - 3 magical damage per second. The damage dealt increases based on your Corruption level when \"Reap\" is cast."},{"ability":"Maleficium","energy":5,"castTime":2.5,"coeff":5.19,"text":"Channelled: Every 0.5 seconds for 2.5 seconds.Consumes 5 Blood Magic Energy.\r\nConjure a series of baleful runes which inflict 8 magical damage per hit.\r\nIncreases your Corruption level by 3 per hit.","passive":"Flay","coeffPassove":5.75,"textPassive":"The magic conjured by your \"Maleficium\" mercilessly tears at your foes, increasing the damage dealt to 6 on enemies who are affected by any of your Blood Magic damage over time effects."},{"ability":"Rupture","castTime":1,"coeff":5.77,"text":"A single target blood magic attack that deals 22 damage and stuns the target. Consumes 2 blood magic energy. Reduces Corruption or Martyrdom by 50.","passive":"Blood Flow","coeffPassove":7.93,"textPassive":"Power flows from the crushed heart of victims of your \"Rupture.\"\r\nIf your Corruption level is above 60 you further afflict the target, dealing 2 magical damage every second for 6 seconds.\r\nIf your Martyrdom level is above 60 you transform the power into healing energy for your defensive target, restoring 2 health every second for 6 seconds.\r\nThese effects are improved if \"Rupture\" successfully interrupts a target."},{"ability":"Desecrate","castTime":1,"coeff":2.2800000000000002,"text":"Consumes 2 Blood Magic Energy.\r\nAfflict your target with the corruption that flows through your veins dealing 3 magical damage every second for 6 seconds. During this time you do not take damage from Corruption. Your Corruption level must be higher than 10 to use this ability.","passive":"Defilement","coeffPassove":"-","textPassive":"While your \"Desecrate\" is active, your Blood Magic abilities inflict further defilement, causing you to gain 20% more Corruption. If you are already at maximum Corruption, your Blood Magic abilities deal 16.5% more damage."},{"ability":"Rejuvenate","text":"Consumes 2 Blood Magic Energy.\r\nRefocus and replenish your energy, restoring 3 health every second for 6 seconds. During this time you do not take damage from Martyrdom. Your Martyrdom level must be higher than 10 to use this ability.","passive":"Resurgence","textPassive":"You draw forth more of your energy when you cast \"Rejuvenate\" improving the healing to 3 per second. In addition, the healing is not reduced by your Martyrdom level."},{"ability":"Runic Hex","castTime":1.5,"coeff":1.5,"text":"Consumes 2 Blood Magic Energy.\r\nCarve a withering hex onto your target's soul which deals 2 magical damage every second for 6 seconds and slows its movement. Applies Debilitated. During this time the target's attacks restore 3 health to whomever they attack.\r\nThe hex explodes violently when it expires, dealing 7 magical damage to nearby enemies and healing nearby allies for 6.\r\nReduces your Corruption or Martyrdom level by 50.","passive":"Paroxysm","textPassive":"The runes inscribed by your \"Runic Hex\" are carved deep, resulting in mass hexing. When \"Runic Hex\" expires, any enemies damaged by the resulting detonation are afflicted with a lesser version of the Hex which deals 2 magical damage every second for 3 seconds and slows their movement. During this time the target's attacks restore 2 health to whomever they attack.\r\nThe hex explodes one final time when it expires, dealing 2 magical damage to nearby enemies and healing nearby allies for 1."},{"ability":"Sanguine Coalescence","energy":4,"castTime":1,"coeff":5.22,"text":"Consumes 4 Blood Magic Energy.\r\nYour blood coalesces to form a barrier around you that absorbs 100% of incoming damage and is destroyed after absorbing 8 damage. The strength of the barrier scales based on your Combat Power.\r\nWhen the barrier either expires or is destroyed, your blood violenty erupts outwards dealing 38 magical damage to all enemies within 5 metres of you.\r\nIncreases your Corruption level by 20 when cast. Reduces your Corruption level by 20 when the barrier expires or is destroyed.","passive":"Convergence","coeffPassove":7.72,"textPassive":"When \"Sanguine Coalescence\" expires or is destroyed, the energy converges inside of you instead of exploding outwards causing your next 4 Blood Magic attacks to deal an additional 10 magical damage."},{"ability":"Eldritch Scourge","energy":4,"castTime":1.5,"coeff":4.11,"text":"Consumes 4 Blood Magic Energy.\r\nRecite a blasphemous invocation which twists and defiles the very being of your target. The destructive energy contained in this magic causes the target to take 4 magical damage every second for 6 seconds. Applies Debilitated.\r\nDuring this time the defilement spreads to nearby enemies causing them to take 92 magical damage every second for 3 seconds. Applies Debilitated. In addition, the original target's essence is separated from their body to heal your nearby allies, restoring 0 health every second for 3 seconds.\r\nIncreases your Corruption or Martyrdom level by 15.","passive":"Desolate","coeffPassove":6.2472,"textPassive":"Your \"Eldritch Scourge\" lays waste to your target's soul increasing the damage and healing done by 52%."},{"ability":"Sanctuary","text":"Consumes 3 Blood Magic Energy.\r\nCall forth a shimmering ward on your defensive target which absorbs 100% of incoming damage and dissipates after absorbing 18 damage. If your defensive target already has a barrier, they are instead healed for 18.\r\nIncreases your Martyrdom level by 8.","passive":"Restorative Ward","textPassive":"Your \"Sanctuary\" ability helps accelerate the restoration process. While an ally is protected by your \"Sanctuary\" barrier effect, each subsequent use of the ability increases the base healing done by 3.5%. This bonus is removed when the barrier effect is removed.\r\nIn addition, applying a barrier with \"Sanctuary\" no longer causes you to take damage from Martyrdom."},{"ability":"Mend","text":"Spill your blood to restore 8 health to the member of your group with the lowest percentage remaining health.\r\nIncreases your Martyrdom level by 2.\r\nRequires a Blood Magic Focus in your Primary Weapon slot.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Convalesce","text":"Consumes 5 Blood Magic Energy.\r\nTrace runes in the air to invoke a powerful restorative spell which heals your group for 11. Any group member with less than 35% remaining health gains a barrier which absorbs 100% of incoming damage and dissipates after absorbing 6 damage.\r\nIncreases your Martyrdom level by 12.","passive":"Soothe","textPassive":"The barrier applied by \"Convalesce\" to low health targets amplifies healing energies, increasing incoming healing from all sources by 15%."},{"ability":"Redemption","text":"Consumes 2 Blood Magic Energy.\r\nRecite an incantation to restore and assuage your defensive target, healing them for 20 and cleansing them of 1 detrimental effect.\r\nReduces your Martyrdom level by 50.","passive":"Mercy","textPassive":"Your \"Redemption\" grants relief and aid to those who need it most. \"Redemption's\" health restoration is increased to 20.\r\nIn addition, \"Redemption\" causes less damage from Martyrdom when used on low health targets and reduces your Martyrdom level more when used on high health targets."},{"ability":"Communion","energy":4,"castTime":2,"coeff":8.3125,"text":"Channelled: Every 0.5 seconds for 2 seconds.Consumes 4 Blood Magic Energy.\r\nShare your lifeblood with your group members to shield them from harm and restore their health. First, each group member receives a barrier which absorbs 100% of incoming damage and dissipates after absorbing 12 damage.\r\nThe remaining power of the spell restores 12 health and cleanses 1 detrimental effect per tick. You do not receive the barrier or healing effects from this spell.\r\nIncreases your Martyrdom level by 4 each tick.","passive":"Sacrament","coeffPassove":9.5625,"textPassive":"The runic energy which maintains the barriers applied by your \"Communion\" ability is bound with a powerful charm. Whenever any of your \"Communion\" barriers are destroyed by incoming damage, your entire group is healed for 6."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Absolution","textPassive":"You have safeguards built into your magic which trigger when your Corruption or Martyrdom level exceeds 60. When this happens, your Corruption or Martyrdom level is reduced by 50 and you regain 25% of your missing health."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Clemency","textPassive":"You are able to draw restorative power from your blood when your life is threatened. Whenever you take damage from Corruption or Martyrdom while your health is below 50% you are healed for 0. This effect can only occur a limited number of times."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Curse of Destruction","coeffPassove":1.4000000000000001,"textPassive":"The power of your Corrupted blood curses your foes to ruination. If your Corruption level is above 10, your Blood Magic critical hits curse your target for 5 seconds causing them to take an additional 9 magical damage from subsequent Blood Magic critical hits."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Crimson Pulse","coeffPassove":0.24,"textPassive":"Your blood surges when you critically hit or heal with Blood Magic abilities. When you critically hit, your target suffers 3 magical damage every second for 3 seconds. When you critically heal, your ally regains 0 health every second for 3 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Last Rites","textPassive":"Your magical power allows you to cheat death for a brief time. Whenever you take damage that would have defeated you and your Corruption or Martyrdom level is above 60, you instead are able to continue living for 4 seconds.\r\n\r\nWhen this time expires, you are truly defeated. If your Corruption level was above 60 when \"Last Rites\" was triggered, you explode upon death dealing 74 magical damage to nearby enemies. If your Martyrdom level was above 60 when \"Last Rites\" was triggered, you explode upon death restorting 0 health to nearby allies."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Sanguine Charm","textPassive":"You keep a small blood charm at the ready to store your gained power. Whenever you would lose power via reduction in your Corruption or Martyrdom level, the damage and healing done by your Blood Magic abilities is increased by 9% for 4 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Rites of Refuge","textPassive":"Your Blood Magic barriers are reinforced by potent magics, increasing the Protection of allies with your barriers by 1225."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Shroud of Retribution","textPassive":"Your Blood Magic barriers are covered in retributive runes, increasing the strength of your Blood Magic barriers by 3% and causing 1 magical damage to any attackers. The damage dealt scales with your Combat Power or Healing Power, whichever is higher."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Red Tide","textPassive":"The flow of your blood-fueled restorative magic grows stronger as your Martyrdom level increases. If you gain two power increases from Martyrdom within 6 seconds, the power of your Blood Magic heals is increased by 10% for 6 seconds."},{"weapon":"Chaos","ability":"Controlled Chaos (Singularity)","energy":"-","castTime":"-","coeff":2.6},{"ability":"Controlled Chaos (Dissonance)","energy":"-","castTime":"-","coeff":2.6},{"ability":"Controlled Chaos (Dissipation)","energy":"-","castTime":"-","coeff":2.6},{"ability":"Controlled Chaos (Cacophony)","energy":"-","castTime":"-","coeff":1.3},{"ability":"Controlled Chaos (Enigma: Crit Power)","energy":"-","castTime":"-","text":"+37.6% critical power"},{"ability":"Controlled Chaos (Enigma: Evade)","energy":"-","castTime":"-","text":"+49% evade chance"},{"ability":"Controlled Chaos (Enigma: Thorns)","energy":"-","castTime":"-"},{"ability":"Controlled Chaos (Enigma: Balance)","energy":"-","castTime":"-"},{"ability":"Deconstruct","castTime":0,"coeff":1.175,"text":"Charge your hands with chaotic energy and strike your target 3 times, dealing 3 magical damage per hit.\r\nRequires a Chaos Focus in your Primary Weapon slot.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Schism","castTime":0,"text":"PBAoE: Affects up to 6 enemies in a 5 metre radius around you.Consumes 3 Chaos Energy.\r\nSplit matter from energy in an area around you, dealing 10 magical damage.","passive":"Paradox Control","textPassive":"The paradoxes generated by your \"Schism\" are all within your control, causing an additional Paradox to be gained when \"Schism\" deals damage divisible by 8."},{"ability":"Entropy","castTime":0,"text":"Increases your damage, critical damage, and causes your attacks to purge for a short time. Consumes 2 chaos energy.     Your Chaos attacks are fueled with the energy Consumes 2 Chaos Energy.\r\nYour Chaos attacks are fueled with the energy that brings all things to their end, increasing all Chaos damage dealt by 10% and Critical Power by 8.6%. Also, your Chaos attacks purge 1 beneficial effect from each target hit. This effect lasts 8 seconds. This ability does not trigger and is not affected by global recharge time.","passive":"Dissolution","textPassive":"Generating a Paradox by dealing damage divisible by 8 while \"Entropy\" is active increases the strength of the decomposing energies. For the remainder of \"Entropy's\" duration, the damage bonus is increased to 24%."},{"ability":"Breakdown","energy":5,"castTime":0,"coeff":3.425,"text":"Consumes 5 Chaos Energy.\r\nFocus your chaotic energy into a series of 4 hits. Each hit breaks down the target's corporeal form dealing 7 magical damage.","passive":"Disintegrate","coeffPassove":4.0249999999999995,"textPassive":"If all hits of \"Breakdown\" are successful, the target's form collapses further dealing 1 magical damage every second for 5 seconds. If this effect is already active, the target instead takes 3 magical damage instantly."},{"ability":"Tumultuous Whisper","castTime":0,"coeff":0.45,"text":"Column: Affects up to 6 enemies in a 2 metre wide by 10 metre long area in front of you.Consumes 2 Chaos Energy.\r\nLet loose a wave of entropic power, withering and decaying enemies in front of you dealing 4 magical damage. Affected enemies are purged of 1 beneficial effect.\r\nThe damage dealt by this attack will always be divisible by eight, resulting in 2 - 4 Paradoxes.","passive":"Duality","coeffPassove":"n/a","textPassive":"If your \"Tumultuous Whisper\" causes you to exceed 8 Paradoxes, the entropic energy splits a portion of your essence into an Extradimensional Doppelganger who will attack your foes."},{"ability":"Rewind","castTime":0,"text":"Consumes 2 Chaos Energy.\r\nYour mastery of chaos allows you to warp reality and undo harm directed at you. For the next 3 seconds, all damage dealt to you is tallied. When the 3 seconds end, you are healed for every point of damage you took during that time. This ability does not trigger and is not affected by global recharge time.","passive":"Flash-back","textPassive":"You alter your \"Rewind\" to reshape the past instead of controlling potential futures. Instead of its usual function, \"Rewind\" will instead instantly restore any health you have lost in the past 3 seconds."},{"ability":"Reality Fracture","castTime":0,"coeff":1.02,"text":"PBAoE: Affects up to 6 enemies in a 5 metre radius around you.Consumes 2 Chaos Energy.\r\nLeap into the air and shatter the barrier between realities and cause chaotic energy to burst forth in an area around you dealing 8 magical damage. Applies Exposed.\r\nIf this attack hits 3 or more enemies, it generates 1 Paradox.","passive":"Rend Space","coeffPassove":3.52,"textPassive":"Your \"Reality Fracture\" rends spacetime itself for 5 seconds. Enemies standing in the wake of your \"Reality Fracture\" are dealt 3 magical damage every second."},{"ability":"Twist Fate","castTime":0,"text":"Consumes 2 Chaos Energy.\r\nTwist probability and chance causing any incoming blows to land less effectively, increasing your Protection by 20300 for 7 seconds. This ability does not trigger and is not affected by global recharge time.","passive":"Backlash","textPassive":"Your control over probability and chance enhances your \"Twist Fate\" to also grant a reflective barrier for 6 seconds. This barrier reflects 50% of incoming damage and will dissipate when it expires or reflects 55% of your maximum health."},{"ability":"Distortion","castTime":0,"text":"Consumes 3 Chaos Energy.\r\nCause a ripple in the fabric of reality within your target dealing 19 magical damage. This attack generates a large amount of hate.","passive":"Veil of Deformity","textPassive":"Your \"Distortion\" deforms the space between you and your enemies, making it harder and more dangerous for them to attack you effectively. Each use of \"Distortion\" grants 2 stacks of a beneficial effect which increases your Protection by 950. Each time you are attacked, the attacker is dealt 1 magical damage and you lose 1 stack."},{"ability":"Turmoil","castTime":0,"text":"PBAoE: Affects up to 6 enemies in a 5 metre radius around you.Execute a spinning kick charged with a torrent of chaotic power dealing 5 magical damage. This attack generates a large amount of hate.\r\nRequires a Chaos Focus in your Primary Weapon slot.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Winds of Change","castTime":0,"text":"PBAoE: Affects up to 6 enemies in a 5 metre radius around you.Consumes 5 Chaos Energy.\r\nSend the destructive winds of change to wreak havoc on nearby enemies dealing 13 magical damage. This attack generates a large amount of hate.","passive":"Contradiction","textPassive":"The \"Winds of Change\" alter the results of your enemies actions. After being damaged by \"Winds of Change\" the next attack your enemies perform will heal their target for 3% of their maximum health."},{"ability":"Evulsion","castTime":0,"text":"Consumes 2 Chaos Energy.\r\nForcibly tear out a portion of the chaotic energy in your target dealing 22 magical damage. The force of the extraction causes the target to be pulled toward you and purges 1 beneficial effect. Additionally, the target is forced to attack you for 5 seconds. This ability has a 15 metre range.","passive":"Mass Evulsion","textPassive":"Your \"Evulsion\" cascades from one enemy to the next. The target and any enemies near the target are pulled towards you, purged, and dealt 7 magical damage."},{"ability":"Pandemonium","energy":4,"castTime":0,"coeff":5.8,"text":"PBAoE: Affects up to 6 enemies in up to a 7 metre area around you.Consumes 4 Chaos Energy.\r\nUnfurl the full extent of the chaotic power that resides in all things. Nearby enemies are caught up in the swell of power and are dealt 43 magical damage as they are flung to the ground.","passive":"Fractured Existence","coeffPassove":8.469999999999999,"textPassive":"The chaotic power unleashed by \"Pandemonium\" lashes out with great force creating Singularities that deal 14 magical damage to enemies caught in the blast."},{"ability":"Anomaly","energy":4,"castTime":3,"coeff":3.42,"text":"Channelled: Every second for 3 seconds.\r\nPBAoE: Affects up to 6 enemies in a 10 metre radius around you.Consumes 4 Chaos Energy.\r\nCreate a localised anomaly within the palm of your hands. Each twist of your hands sends out waves of destructive energy dealing 9 magical damage and sending targets flying into the air. Applies Exposed. Your Evade Chance is increased by 25% while channeling this ability.\r\nDamage dealt by this ability has a 20% chance to generate 1 Paradox.","passive":"Disorientation","coeffPassove":4.25,"textPassive":"The reality bending properties of your \"Anomaly\" confuse and disorient your enemies. When they regain their senses and stand back up, they are dealt 5 magical damage."},{"ability":"Immutable","energy":4,"castTime":0,"coeff":"n/a","text":"Consumes 4 Chaos Energy.\r\nThe swirling torrent of chaotic energy within you mends and unmakes even fatal wounds. For the next 5 seconds you generate more hate and cannot be defeated by normal means. When this effect expires, you heal for 40% of your maximum health. This ability does not trigger and is not affected by global recharge time.","passive":"Incongruity","coeffPassove":"n/a","textPassive":"While you are \"Immutable,\" the damage you receive is redirected into generating Paradoxes. When \"Immutable\" expires, you generate 1 Paradox for every 8% of health you lost, even if that damage was prevented by \"Immutable.\""},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Paradoxical Restoration","textPassive":"You direct the paradoxical energies generated by your chaotic magic towards unmaking your injuries. Whenever you generate a Paradox, you restore 4% of your maximum health."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Resonance Cascade","textPassive":"The resonant energy of your Chaotic Enigmas automatically grant power to you and your group members without the need for purging. In addition, you have an 18.5% chance to generate 1 Paradox every second while in combat."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Body Double","textPassive":"You become more in tune with your Extradimensional Doppelgangers, increasing the damage they deal by 125%."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Long Term Chaos","textPassive":"Through probability manipulation you are able to extend the duration of the beneficial effects caused by your Chaotic Enigmas by 2 seconds. In addition, your Wellness Engima's restorative effect is increased by 50%."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Eye of the Ruinstorm","coeffPassove":4.35,"textPassive":"You focus the potential energy of your Singularities causing them to detonate more slowly, but also improving the damage they deal to 22 magical damage."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Butterfly Effect","coeffPassove":0.83,"textPassive":"Your chaotic magics generate destructive disturbances in nearby enemies. Whenever you deal damage with Chaos Abilities, you have a 10% chance to deal 3 magical damage to another nearby enemy and generate 1 Paradox."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Aegis of Parallelism","textPassive":"When your Paradox count resets, you have a 50% chance to tap into the expended energy and shield yourself, increasing your Protection by 1350 for 4 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Blessing of Octed","textPassive":"You are blessed by the powers of chance, increasing the likelihood of your Chaos Abilities dealing damage divisible by 8 by 6.25%, thereby generating Paradoxes."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Probability Protection","textPassive":"Your Chaos Abilities bend probability and chance in your favor. Whenever you deal damage divisible by 8 with Chaos Abilities, you have a 30% chance to gain a beneficial effect which increases your Protection by 575 for 6 seconds."},{"weapon":"Elemental","ability":"Thermotics (0-25 heat)","energy":"-","castTime":"-","coeff":0,"text":"x1.000 damage"},{"ability":"Thermotics (26-50 heat)","energy":"-","castTime":"-","coeff":1.092,"text":"x1.092 damage"},{"ability":"Thermotics (51-75 heat)","energy":"-","castTime":"-","coeff":1.184,"text":"x1.184 damage"},{"ability":"Thermotics (76-100 heat)","energy":"-","castTime":"-","coeff":1.369,"text":"x1.369 damage"},{"ability":"Fireball","energy":0,"coeff":1.175,"text":"Launch a ball of flame at your target dealing 6 magical damage.\r\nIncreases your heat level by 6.\r\nRequires an Elementalism Focus in your Primary Weapon slot.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Chain Lightning","energy":3,"text":"Chain: Jumps up to 8 metres 5 times, hitting up to 6 enemies.Consumes 3 Elemental Energy.\r\nSend a crackling bolt of lightning through your target which then leaps to nearby enemies. Affected targets are dealt 6 magical damage.\r\nIncreases your heat level by 14.","passive":"Static Charge","textPassive":"Your \"Chain Lightning\" charges targets with static energy for 3 seconds. The next time you damage a static-charged target with \"Chain Lightning\" the static energy is discharged dealing 4 magical damage to the target and enemies near the target."},{"ability":"Flash Freeze","energy":2,"castTime":1,"coeff":1.45,"text":"PBAoE: Affects up to 6 enemies in a 5 metre range around you.Consumes 2 Elemental Energy.\r\nInstantly freeze the area around you dealing 7 magical damage. Applies Debilitated.\r\nReduces your heat level by 40. Can be used while Overheated to remove the Overheated effect.","passive":"Cryoblast","coeffPassove":"n/a","textPassive":"Enemies damaged by your \"Flash Freeze\" experience an even deeper chill, freezing them in place for 4 seconds. In addition if \"Flash Freeze\" is used when your heat level is above 30, you harness the heat energy lost, turning it into a beneficial effect which increases your Elemental damage by 20% for 5 seconds."},{"ability":"Mjolnir","energy":5,"castTime":1,"coeff":3.425,"text":"Consumes 5 Elemental Energy.\r\nHarness the power of the mythical hammer to send devastating bolts of lightning at your target dealing 15 magical damage.\r\n\r\nIncreases your heat level by 21.","passive":"Superconductor","coeffPassove":3.972999999999999,"textPassive":"Increase the conductivity of your \"Mjolnir\" causing it to strike unerringly and with devastating effect. \"Mjolnir\" can no longer glance and its critical hits deal 32% more damage."},{"ability":"Crystallised Frost","energy":2,"castTime":1,"coeff":1.08,"text":"Consumes 2 Elemental Energy.\r\nSummon a crystallised manifestation of ice at your location that lasts 9 seconds. Every 3 seconds it will hit up to 6 enemies in a 5 metre radius, dealing 2 magical damage. Applies Debilitated.\r\nReduces your heat level by 10 when summoned and if you are standing within the cold area when a damage pulse occurs. Can be used while Overheated.","passive":"Icy Steps","coeffPassove":"n/a","textPassive":"You attune yourself to your \"Crystallised Frost\" causing it to follow you wherever you go. In addition, the amount of heat reduction is increased to 15 per pulse and each pulse also immobilises targets for 2 seconds."},{"ability":"Crystallised Flame","energy":2,"castTime":1,"cooldown":20,"coeff":3.4,"text":"Consumes 2 Elemental Energy.\r\nSummon a crystallised manifestation of fire at the targeted point that lasts 10 seconds. Every 2.5 seconds it will deal 3 magical damage to the closest enemy within a 5 metre radius.\r\nIncreases your heat level by 25.","passive":"Crystallised Blaze","coeffPassove":14.7,"textPassive":"Empower your \"Crystallised Flame\" with a wildly whirling blaze, causing it to slow the movement speed of all enemies in the targeted area and instead deal 3 magical damage every 0.5 seconds to all targets in the affected area."},{"ability":"Crystallised Storm","energy":2,"castTime":1,"coeff":1.3,"text":"Consumes 2 Elemental Energy.\r\nSummon a crystallised manifestation of lightning at the targeted point that lasts 10 seconds. Every second, it deals 1 magical damage to nearby enemies as lightning jumps between them. If your heat level is above 25, affected enemies have 1 beneficial effect purged from them.\r\nIncreases your heat level by 25.","passive":"Discharge","coeffPassove":3.5733699999999997,"textPassive":"When \"Crystallised Storm\" purges a beneficial effect from a target, the magical energy is discharged violently dealing 3 magical damage to the target and nearby enemies. This effect has a 33% chance to trigger on targets who do not have any beneficial effects."},{"ability":"Flicker","energy":2,"text":"Consumes 2 Elemental Energy.\r\nYou vanish with a flicker of electricity and teleport 10 metres forward. When you arrive at your destination, the area becomes electrified. Enemies standing in the area are dealt 2 magical damage every second. This ability can be activated a second time within 5 seconds of the first use.\r\nThe first activation of this ability reduces your heat level by 40. Can be used while Overheated to remove the Overheated effect. If the follow-up activation is used, it increases your heat level by 25 heat.","passive":"Volatile Current","textPassive":"You reappear with a blast of electrical energy when using \"Flicker.\" Immediately after arriving at your destination, you stun any nearby enemies for 3 seconds and deal 6 magical damage."},{"ability":"Fire Bolt","energy":3,"castTime":1,"coeff":2.525,"text":"Consumes 3 Elemental Energy.\r\nFling a flaming bolt at your target dealing 11 magical damage.\r\nIncreases your heat level by 14.","passive":"Blazing Bolts","coeffPassove":2.8406249999999997,"textPassive":"Your \"Fire Bolt\" grows hotter and more powerful with each successive use. Each time you use \"Fire Bolt\" your next \"Fire Bolt\" generates 1 additional heat and deals 5% more damage. This effect can stack up to 4 times. Using any ability other than \"Fire Bolt\" removes this effect."},{"ability":"Shock","energy":0,"text":"Chain: Jumps up to 8 metres 5 times, hitting up to 6 enemies.Send a shock of electricity through your target which chains to other nearby targets. Affected targets are dealt 3 magical damage.\r\n\r\nIncreases your heat level by 6.\r\n\r\nRequires an Elementalism Focus in your Primary Weapon slot.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Inferno","energy":5,"text":"TAoE: Affects up to 6 enemies in a 5 metre radius around the target.Consumes 5 Elemental Energy.\r\nCreate a blazing inferno at the target's location that deals 8 magical damage.\r\nIncreases your heat level by 21.","passive":"Scorched Earth","textPassive":"The heat of your \"Inferno\" burns hot enough to ignite the ground. If your heat level is above 30, \"Inferno\" leaves a damaging area which deals 1 magical damage every second for 10 seconds."},{"ability":"Flashpoint","energy":2,"text":"Consumes 2 Elemental Energy.\r\nYou harness the destructive forces of Elementalism for 4 seconds. During this time, all of your Elementalism abilities deal damage as if you were at the maximum heat level. Your heat level neither increases nor decreases for the duration of this beneficial effect. This ability does not trigger and is not affected by global recharge time.","passive":"Blast Wave","textPassive":"When \"Flashpoint\" expires, you expel the increased heat from your body dealing 7 - 13 magical damage to nearby enemies. The damage dealt increases based on your heat level when\"Flashpoint\" expires."},{"ability":"Ice Beam","energy":4,"castTime":2,"cooldown":20,"coeff":6.98,"text":"Consumes 4 Elemental Energy.\r\nFocus your energy to unleash a gelid beam of frost at your target dealing 30 magical damage and slowing its movement. Applies Debilitated.\r\nReduces your heat level by 40. Can be used while Overheated to remove the Overheated effect.","passive":"Glaciate","coeffPassove":9.48,"textPassive":"Ice Beam freezes the target, causing them to become brittle for 5 seconds. Attacks against the brittle target deal an additional 3 magical damage."},{"ability":"Blizzard","energy":4,"castTime":1,"cooldown":20,"coeff":5.44,"text":"Consumes 4 Elemental Energy.\r\nCreate an intense blizzard at the targeted point that lasts 8 seconds. Every 0.5 seconds it will deal 2 magical damage to up to 6 enemies in a 5 metre radius. Applies Debilitated. Targets that are hit 5 times are rooted to the ground for 4 seconds.\r\nReduces your heat level by 40. Can be used while Overheated to remove the Overheated effect.","passive":"Frigid Tempest","coeffPassove":6.582400000000001,"textPassive":"The frozen winds of your \"Blizzard\" chill enemies to their core, increasing the damage dealt by 21%. In addition, enemies damaged by \"Blizzard\" are instantly immobilised and standing in your \"Blizzard\" reduces your heat level by 2 every 0.5 seconds."},{"ability":"Overload","energy":4,"castTime":3,"coeff":8.01,"text":"Channelled: Every second for 3 seconds.\r\nGTAoE: Affects up to 6 enemies in a 10 metre radius around the targeted point.Consumes 4 Elemental Energy.\r\nBlast the targeted area with a barrage of elemental energy dealing 12 magical damage per hit. The cold portion of this ability applies Debilitated. The electrical portion of this ability purges 2 beneficial effects.\r\n\r\nThe cold portion of this ability reduces your heat level by 40. The fire and electrical portion of this ability each increase your heat level by 10. Can be used while Overheated to remove the Overheated effect.","passive":"Elemental Force","coeffPassove":10.343,"textPassive":"Harness the force of the elements when you use \"Overload.\" The cold portion of this attack's Heat reduction is increased to 50, the electrical portion causes enemies in the area take an additional 4 magical damage, and the fire portion knocks down enemies for 3 seconds and sets them ablaze dealing 1 magical damage every second for 6 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Cauterise","textPassive":"Expend your heat to staunch your wounds. Every 3 heat generating abilities you use restores 2% of your maximum health and reduces your heat level by 4."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Elemental Control","coeffPassove":"0.05/0.25","textPassive":"You have mastered the inner workings of fire and electricity. \r\nWhenever you deal damage with an Elemental fire ability, you set the target on fire dealing 1 magical damage every second for 5 seconds. \r\nWhenever you deal damage with an Elemental electrical ability you create an electrical current within the target for 3 seconds. If you damage the target again while this effect is active, the target and nearby enemies are dealt 2 magical damage."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Calorimetry","coeffPassove":0.871,"textPassive":"Your internal temperature runs hotter than the average person. Your base out of combat heat level is increased to 15. Also, your first Elementalism attack when entering combat deals an additional 4 magical damage. While in combat, this bonus damage effect can occur once every 10 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Thermodynamo","textPassive":"The heat within you burns bright and strong. When at the maximum heat level, the bonus damage from heat is increased by 4.5%."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Combustion","coeffPassove":0.25,"textPassive":"Whenever you critically hit with Elemental fire or electrical abilities, heat blazes inside of you dealing an additional 2 magical damage to the target. Also, your heat level increases by an additional 5. This bonus heat is not generated if your heat level is above 50."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Lingering Frost","textPassive":"Your cold abilities provide a lingering presence of frost, cooling you down afterward and leaving your foes frostbitten. Enemies damaged by your cold abilities are dealt 2 magical damage every second for 5 seconds. Also, after using any cold ability, you will lose an additional 2 heat every second for 5 seconds and nearby enemies have their hate towards you reduced."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Thermocoupler","textPassive":"Your understanding of heat allows you to flow easily from one element to the next.\r\nWhen using Elemental fire abilities, your next Elemental electrical ability will reduce your heat level by 3.\r\nWhen using Elemental electrical abilities, your next Elemental fire ability will reduce your heat level by 3.\r\nOnce either of these heat reducing effects have triggered 4 times, the attack which triggered it deals an additional 5 magical damage."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Supercooler","textPassive":"As fights go on, you improve your efficiency at managing your heat. You gain 1 \"Supercooler\" counter when entering combat and every 5 seconds afterward. Every 5 seconds, you reduce your current heat level by 2 per stack of \"Supercooler.\" This effect can stack a maximum of 5 times. When this heat reduction occurs, the remaining recharge time for all Elementalism cold abilities is reduced by 7%."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Maxwell's Demon","textPassive":"You excel at managing and equalizing your heat. Whenever you critically hit with an Elemental ability, you store your current heat level. 4 seconds later, you reduce your heat level to the stored level if the stored level is lower than your current heat level. This effect can only occur once every 5 seconds and if your heat level is above 50."},{"weapon":"Shotgun","ability":"Heavy Munitions (Dragon's Breath)","energy":"-","castTime":"-","coeff":0.147,"text":"Up to 6 stacks"},{"ability":"Heavy Munitions (Depleted Uranium)","energy":"-","castTime":"-","coeff":0.97},{"ability":"Heavy Munitions (Anima-Infused)","energy":"-","castTime":"-"},{"ability":"Heavy Munitions (Armor-Piercing)","energy":"-","castTime":"-"},{"ability":"Pump Action","energy":0,"castTime":0,"coeff":1.175,"text":"Blast an enemy with a shot from your shotgun dealing 9 physical damage.\r\nConsumes 1 shell.\r\nRequires a Shotgun in your Primary Weapon slot.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Both Barrels","energy":3,"castTime":0,"text":"Cone: Affects up to 6 enemies in a 60 degree 7 metre cone in front of you.Consumes 3 Shotgun Energy.\r\nUnleash a deadly diffused blast from your shotgun dealing 10 physical damage to enemies in front of you.\r\n\r\nConsumes 1 shell.","passive":"Blast Barrels","textPassive":"Concentrate additional power into your \"Both Barrels\" ability, causing this ability to perform an additional hit dealing 2 physical damage to each target."},{"ability":"Opening Shot","energy":2,"castTime":0,"text":"Consumes 2 Shotgun Energy.\r\nFire a shot into the air to signal it is time to open fire. For the next 8 seconds, you and your group members' Critical Power is increased by 30%. A target can only gain this bonus once every 20 seconds. This ability does not trigger and is not affected by global recharge time.\r\n\r\nConsumes 1 shell.","passive":"Fire at Will","textPassive":"Keep firing! When you activate \"Opening Shot\" you gain a beneficial effect that causes your Shotgun attacks to deal 1 additional physical damage until an enemy deals damage to you. Also, when you critically hit with a Shotgun ability while \"Opening Shot\" is active you reload 1 shell."},{"ability":"Raging Shot","energy":5,"castTime":0,"coeff":3.425,"text":"Consumes 5 Shotgun Energy.\r\nConcentrate your power into a full-force shotgun blast dealing 25 physical damage.\r\nConsumes 1 shell.","passive":"Point Blank Shot","coeffPassove":4,"textPassive":"Get up close and personal with \"Raging Shot,\" increasing the damage dealt to 18 physical damage to targets within 3 metres."},{"ability":"Reconsituting Shells","energy":2,"castTime":0,"text":"Consumes 2 Shotgun Energy.\r\nRepurpose some of your power from your shotgun shells to cleanse 1 detrimental effect from yourself and heal yourself and your group members for 16% - 26% of their maximum health. The amount of health restored is based on how many shells were repurposed. This ability does not trigger and is not affected by global recharge time.\r\nConsumes 6 shells.","passive":"Fortifying Shells","textPassive":"Fortify yourself and your group members with your \"Reconstituting Shells\" ability, improving Protection by 2045 for 10 seconds. This bonus stacks for each shell spent and group members receive half that amount."},{"ability":"Glutton for Punishment","energy":2,"castTime":0,"text":"PBAoE: Affects up to 6 enemies in a 5 metre radius around you.Consumes 2 Shotgun Energy.\r\nGoad nearby enemies into attacking you for 6 seconds. During this time, your Protection is increased by 23700. Additionally, gain bonus hate on goaded enemies based on the number of shells consumed. This ability does not trigger and is not affected by global recharge time.\r\n\r\nConsumes 6 shells.","passive":"Hurt Me More","textPassive":"While \"Glutton for Punishment\" is active, your enemies failed attacks strengthen your resolve. Attacks which glance you heal you for 10% of your maximum health."},{"ability":"Shell Salvage","energy":0,"castTime":0,"coeff":3.6,"text":"Salvage some of your power from your shotgun shells to gain 3 - 8 Shotgun Energy. The amount gained is based on how many shells were salvaged. This ability does not trigger and is not affected by global recharge time.\r\n\r\nConsumes 6 shells.","passive":"Salvage Expert","textPassive":"When using \"Shell Salvage,\" your expertise at salvaging allows you to cause this ability to always offer the option to reload the same type of shell you just salvaged. In addition, you also gain 5 Energy for your other weapon."},{"ability":"Cleanup","energy":2,"castTime":0,"text":"Consumes 2 Shotgun Energy.\r\nIsolate the purifying elements in your shotgun shells and disperse it to all of your group members. For the next 9 seconds, each group member is cleansed of 1 detrimental effect every 1.5 seconds. This ability does not trigger and is not affected by global recharge time.\r\n\r\nConsumes 6 shells.","passive":"Cleanup Crew","textPassive":"Whenever \"Cleanup\" purifies you or a group member of a detrimental effect, they are empowered. For the next 6 seconds, all of their attacks deal an additional 2 physical damage."},{"ability":"Rocket Pod","energy":3,"castTime":0,"text":"Consumes 3 Shotgun Energy.\r\nLaunch a miniaturised rocket at your target dealing 19 physical damage. This attack generates a large amount of hate.\r\nConsumes 1 shell.","passive":"Reinforced Rockets","textPassive":"Whenever you fire a \"Rocket Pod\" you also bolster your defences, increasing your Protection by 2860 for 5 seconds. This effect can stack up to 3 times."},{"ability":"Scattershot","energy":0,"castTime":0,"text":"Cone: Affects up to 6 enemies in a 60 degree 7 metre cone in front of you.Fire a blast of shot from your shotgun at enemies in front of you dealing 5 physical damage. This attack generates a large amount of hate.\r\nConsumes 1 shell.\r\nRequires a Shotgun in your Primary Weapon slot.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"HEAT Round","energy":5,"castTime":0,"text":"TAoE: Affects up to 6 enemies in a 5 metre radius around the target.Consumes 5 Shotgun Energy.\r\nLaunch a high-explosive anti-tank round at your target dealing 13 physical damage to any enemies caught in the blast. This attack generates a large amount of hate.\r\nConsumes 1 shell.","passive":"Controlled Blasts","textPassive":"When launching your \"HEAT Round\" at enemies, you draw strength from those affected by the blast. You gain 140 Protection for each enemy caught in the blast.\r\nAdditionally, any allies within the blast radius gain 140 Protection. This effect lasts 10 seconds and can stack up to 10 times."},{"ability":"CQC","energy":2,"castTime":0,"text":"Consumes 2 Shotgun Energy.\r\nBash an enemy with the stock of your shotgun, knocking them down. Follow up with a close-range shotgun blast dealing 22 physical damage.\r\nThis ability has a 3 metre range.\r\nConsumes 1 shell.","passive":"Fatal Funnel","textPassive":"Your mastery of \"CQC\" allows you to deal with crowds more effectively. Enemies within 5 metres of the target are also fully affected by this ability. Additionally, any target who is successfully interrupted by this attack is dealt 5 physical damage."},{"ability":"Full Salvo","energy":4,"castTime":2.5,"coeff":7.55,"text":"Channelled: Every 0.5 seconds for 2.5 seconds.\r\nCone: Affects up to 6 enemies in a 9 metre long 60 degree cone in front of you.Consumes 4 Shotgun Energy.\r\nLay waste to all who stand before you with repeated blasts from your shotgun dealing 12 physical damage per hit.\r\nConsumes 5 shells.","passive":"Withering Salvo","coeffPassove":13.59,"textPassive":"Pour your full force into your \"Full Salvo\" ability, causing each successive hit to deal 40% more base damage."},{"ability":"Bombardment","energy":4,"castTime":0,"coeff":5.6,"text":"Consumes 4 Shotgun Energy.\r\nFire all of your shells into the air and cause them to rain down at the targeted point. A shell will strike a random enemy within 7 metres every 1.25 seconds for 10 seconds.\r\n\r\nAffected enemies are dealt 6 physical damage and are Exposed. Other enemies within 3 metres of the target are dealt 3 physical damage.\r\n\r\nConsumes 6 shells.","passive":"Cluster Bombs","coeffPassove":13.04,"textPassive":"When the shells you launched with \"Bombardment\" strike an enemy, they break off randomly into 3 additional smaller explosives dealing 2 physical damage."},{"ability":"Kneecapper","energy":4,"castTime":0,"coeff":4.65,"text":"Cone: Affects up to 6 enemies in a 60 degree 9 metre cone in front of you.Consumes 4 Shotgun Energy.\r\nFire a concentrated shot of power from your shotgun towards the ground creating a blast wave in front of you, knocking enemies down, dealing 34 physical damage, and slowing their movement. This attack generates a large amount of hate.\r\n\r\nFor 8 seconds afterward, all attacks against you are 42% - 49% more likely to glance. This bonus increases based on the number of shotgun shells consumed.\r\n\r\nConsumes 6 shells.","passive":"Stand Firm","coeffPassove":"n/a","textPassive":"When using \"Kneecapper\" your sturdy footing allows you to improve the duration of the effect to 10 seconds. In addition, the bonus granted is always the maximum possible, regardless of the number of shells consumed."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Restorative Reload","textPassive":"Whenever you reload your shotgun you salvage a portion of your power, healing you for 6% of your maximum health."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Odds and Evens","textPassive":"When you have an odd number of shells loaded, your Shotgun basic abilities deal 70% more damage. When you have an even number of shells loaded, your Shotgun power abilities deal 15% more damage."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"White Phosphorus Shells","coeffPassove":0.16464,"textPassive":"Pack additional incendiaries into your Dragon's Breath Shells, improving the damage they deal by 12%."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Enrich","textPassive":"Whenever you load Depleted Uranium Shells, you feed in 2 extra shells."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Munitions Expert","textPassive":"You are an expert with all manner of munitions, allowing you to have more opportunities to load Dragon's Breath Shells, Depleted Uranium Shells, and Armor-Piercing Shells."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Condensed Anima Shells","textPassive":"You condense the anima in your Anima-Infused Shells, improving their healing power. You now regain 4.5% of your maximum health when firing these shells."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Riot Shield","textPassive":"Whenever you reload your Shotgun, you gather your resolve and shield yourself. For the next 4 seconds, your Protection is increased by 1500."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Combat Reload","textPassive":"While in combat, if you still have shells loaded in your shotgun, you load an additional shell every 5 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"No Time to Bleed","textPassive":"Whenever an attack glances you, you shrug off the attack and focus on pushing onward. Your next Shotgun attack after being glanced will heal you for 3% of your maximum health."},{"weapon":"Pistol","ability":"Chamber Roulette (Red)","energy":"-","castTime":"-","coeff":2,"text":"2.78% chance"},{"ability":"Chamber Roulette (Blue)","energy":"-","castTime":"-","coeff":1.25,"text":"11.11% chance"},{"ability":"Chamber Roulette (White)","energy":"-","castTime":"-","coeff":0.65,"text":"25% chance"},{"ability":"Hair Trigger","energy":0,"castTime":0,"coeff":1.175,"text":"Snap a quick shot at your target with your pistol, dealing 9 physical damage.\r\n\r\nRequires Pistols in your Primary Weapon slot.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Controlled Shooting","energy":3,"castTime":0,"text":"Chain: Jumps up to 8 metres 5 times, hitting up to 6 enemies.Consumes 3 Pistol Energy.\r\nFire your shot at your target in such a way that it rolls through them and nearby enemies. Affected targets are dealt 10 physical damage.","passive":"High Roller","textPassive":"Your \"Controlled Shooting\" rolls through enemies and becomes even stronger for each enemy it hits, increasing the base damage by 10% on each successive enemy."},{"ability":"Flourish","energy":0,"castTime":0,"text":"Spin your pistols and ready yourself for action, allowing you to recover 4 Pistol Energy and cleanse yourself of 1 detrimental effect. This ability does not trigger and is not affected by global recharge time.","passive":"Lethal Aim","textPassive":"Your \"Flourish\" allows you focus your aim to deadly effect. For the next 6 seconds after use, your Pistol abilites deal 15% more damage and cannot be evaded or glance."},{"ability":"Unload","energy":5,"castTime":2.5,"coeff":5.19,"text":"Channelled: Every 0.5 seconds for 2.5 seconds.Consumes 5 Pistol Energy.\r\nEmpty the clips of both of your pistols into your target, dealing 8 physical damage per hit.","passive":"Holdout","coeffPassove":"-","textPassive":"You hold out as long as you can when you finish using \"Unload,\" granting you a 33% chance to not spin your chambers if you already have a matched set."},{"ability":"Full House","energy":2,"castTime":0,"text":"Consumes 2 Pistol Energy.\r\nDefy the odds and twist fate into forcing your pistol chambers to a Double Blue set for 3 seconds. This ability does not trigger and is not affected by global recharge time.","passive":"Stacked Deck","textPassive":"Stack the odds even further in your favor, increasing the duration of \"Full House\" to 5 seconds."},{"ability":"Clean Slate","energy":2,"castTime":0,"text":"Consumes 2 Pistol Energy.\r\nChannel your energy for restorative purposes, cleansing yourself and all group members of 3 detrimental effects and healing them for 11. The amount healed increases based on your Attack Rating.","passive":"Rehabilitation","textPassive":"Your \"Clean Slate\" helps your allies recover more efficiently. If \"Clean Slate\" cleanses an ally of a detrimental effect, the healing output is increased to 12."},{"ability":"Six Line","energy":2,"castTime":0,"text":"Consumes 2 Pistol Energy.\r\nTake a chance and set your left pistol chamber to red for 6 seconds. During this time, all of your pistol attacks deal an additional 3 physical damage. This ability does not trigger and is not affected by global recharge time.","passive":"Mulligan","textPassive":"If you don't get a Double Red set during \"Six Line\" you get a second chance, resetting the cooldown."},{"ability":"Kill Blind","energy":2,"castTime":0,"coeff":0.82,"text":"Consumes 2 Pistol Energy.\r\nRaise the odds of killing your target by stunning and shooting them with each pistol. The shot deals 6 physical damage and extends the duration of any active matched chamber damage bonus by 1.5 seconds. Applies Exposed. Applies Debilitated.","passive":"Focused Fire","coeffPassove":3.32,"textPassive":"When you use \"Kill Blind\" you prepare for your next move. If you do not have a locked set of matching chambers, you gain a Double White set. Additionally, the damage of \"Kill Blind\" is increased to 15 physical damage."},{"ability":"Dual Shot","energy":3,"castTime":0,"coeff":2.525,"text":"Consumes 3 Pistol Energy.\r\nCharge up and simultaneously fire both of your pistols at your target dealing 19 physical damage.","passive":"Fatal Shot","coeffPassove":2.915,"textPassive":"Your critical hits with \"Dual Shot\" are more potent, dealing an additional 4 physical damage."},{"ability":"Seeking Bullet","castTime":0,"text":"Chain: Jumps up to 8 metres 5 times, hitting up to 6 enemies.Fire shots from your pistols that seek out and damage enemies for 5 physical damage.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Charged Blast","castTime":0,"text":"TAoE: Affects up to 5 enemies in a 6 metre radius around the target.Consumes 5 Pistol Energy.\r\nSend a wave of volatile energy through the ground towards your target. The energy detonates upon arrival dealing 13 physical damage to the target and nearby enemies.","passive":"Blast Crater","textPassive":"Your \"Charged Blast\" detonation is so powerful it cause enemies who remain in the blast radius to take 1 physical damage every second they remain in the area. Enemies damaged by this effect have their movement speed slowed."},{"ability":"Ricochet","castTime":0,"text":"Consumes 2 Pistol Energy.\r\nYour mastery of angles and trajectories allows you to ricochet your bullets from one target to another for 6 seconds. Your target and nearby enemies are dealt an additional 2 physical damage whenever you deal damage with Pistol abilities. This ability does not trigger and is not affected by global recharge time.","passive":"Bullet Echo","textPassive":"When your \"Ricochet\" expires you retain traces of the bounding energy for 4 seconds, causing your Pistol attacks to chain to nearby enemies dealing 2 physical damage."},{"ability":"All In","energy":4,"castTime":3,"cooldown":20,"coeff":8.16,"text":"Channelled: Every 0.3 seconds for 3 seconds.Consumes 4 Pistol Energy.\r\nUnleash an all-out hail of fire at your target.\r\n  •First 3 hits: 4 physical damage. \r\n  •Next 3 hits: 5 physical damage. \r\n  •Next 3 hits: 6 physical damage in a 5 metre area around the target. \r\n  •Final hit: 15 physical damage.","passive":"Royal Flush","coeffPassove":10.65,"textPassive":"You know the best time to go \"All In\" causing this ability to have additional effects if you have a set of matching chambers.\r\n  •Double White: The target and nearby enemies are dealt an additional 2 physical damage. Applies Exposed. Applies Debilitated.\r\n  •Double Blue: The target and nearby enemies are dealt an additional 2 physical damage.\r\n  •Double Red: The target and nearby enemies are dealt an additional 4 physical damage."},{"ability":"Trick Shot","energy":4,"castTime":0,"cooldown":20,"coeff":5.6,"text":"TAoE: Affects up to 6 enemies in a 5 metre radius around the target. Consumes 4 Pistol Energy.\r\nFire a pair of swirling bullets at your target. The bullets explode on impact dealing 41 physical damage to the target and nearby enemies. Applies Exposed. Applies Debilitated.","passive":"Bamboozle","coeffPassove":7.68,"textPassive":"Your \"Trick Shot\" disables and confuses the enemies it damages causing them to become stunned, rooted, or snared.\r\nStunned enemies take an additional 2 physical damage when they are damaged by you or your allies.\r\nRooted enemies are dealt 11 physical damage when the root effect expires.\r\nSnared enemies and other enemies near them are dealt 2 physical damage every second."},{"ability":"Bullet Ballet","energy":4,"castTime":2,"cooldown":20,"coeff":7,"text":"Channelled: Every 0.2 seconds for 2 seconds.\r\nPBAoE: Affects up to 6 enemies in a 10 metre radius around you.Consumes 4 Pistol Energy.\r\nIn an exquisite display of gunmanship, fire a rapid succession of shots at all nearby targets dealing 6 physical damage per hit and slowing their movement.\r\nYou are unable to move while channeling this ability.","passive":"Deadly Dance","coeffPassove":10.1,"textPassive":"As you execute your \"Bullet Ballet\" your bullets follow your lead and dance from target to target, dealing an additional 2 physical damage."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Second Wind","textPassive":"When your chambers land on a matching set you are energized, restoring 3.5% of your maximum health."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Beginner's Luck","textPassive":"You instinctively know the best first approach to a target, causing your Pistol abilities to deal an additional 1 - 1 physical damage. The damage dealt is at its highest when the target is at maximum health."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Flechette Rounds","coeffPassove":0.1825,"textPassive":"When you have a matching set of chambers, your bullets from your Pistol attacks splinter off and inflict 1 physical damage to nearby enemies."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Heavy Caliber Rounds","textPassive":"Your bullets pack an additional punch. Whenever you have a matching set of chambers, the bonus damage dealt is increased.\r\n  •Double White: Damage increased by 28%.\r\n  •Double Blue: Damage increased by 14.5%.\r\n  •Double Red: Damage increased by 9%."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Double Down","textPassive":"You double down on your Pistol Power Abilities with great intensity. After using a Pistol Power Ability on a target you mark them, causing subsequent Pistol abilities to deal an additional 1 - 2 physical damage. The amount of damage increases the longer the target has been marked. Each mark lasts 8 seconds and only one target can be marked at a time."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Jackpot","textPassive":"Lady luck smiles on you. Whenever you land on a matching set of chambers, you gain a beneficial effect which causes your Pistol attacks to deal an additional 2 physical damage for 3 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Win Streak","textPassive":"When you win, you keep on winning. Whenever you deal bonus damage from a matched set of chambers, you deal an additional 1 - 2 physical damage. The damage dealt increases with each consecutive bonus damage hit."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Fully Loaded","textPassive":"When your Pistol Energy reaches its maximum, you ready yourself for a fight. Whenever your Pistol Energy reaches 15 you are automatically given a Double White match if you do not already have a match."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Fixed Game","textPassive":"You take the time to rig the game in your favor. If you haven't used a Pistol Ability in the last 4 seconds, your right chamber is set to match your left chamber."},{"weapon":"Rifle","ability":"Placed Shot","energy":0,"castTime":0,"coeff":1.175,"text":"Take aim and fire a single shot at your target dealing 9 physical damage.\r\nRequires an Assault Rifle in your Primary Weapon slot.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Full Auto","energy":3,"castTime":0,"text":"TAoE: Affects up to 6 enemies in a 5 metre radius around the target.Consumes 3 Assault Rifle Energy.\r\nUnload a hail of bullets at your target and nearby enemies. Affected targets are hit 4 times for 3 physical damage each time.\r\nYou have a 37.5% chance to load a grenade when using this ability.","passive":"Extended Magazine","textPassive":"An extended magazine allows you to fire more shots when you use \"Full Auto,\" increasing the number of hits to 5."},{"ability":"Lock & Load","energy":0,"castTime":0,"text":"Harness your energy and gain 4 Assault Rifle Energy. This ability does not trigger and is not affected by global recharge time.","passive":"Heavy Payload","textPassive":"You keep your explosives at the ready. When you use \"Lock & Load\" you have a 41% to load a grenade."},{"ability":"Burst Fire","energy":5,"castTime":0,"coeff":3.425,"text":"Consumes 5 Assault Rifle Energy.\r\nSwitch your rifle to burst mode and fire at your target, hitting 3 times, dealing 19 physical damage per hit.\r\nYou have a 65% chance to load a grenade when using this ability.","passive":"Stability","coeffPassove":4.2813,"textPassive":"You keep your aim steady when using \"Burst Fire,\" causing each successive hit to deal 25% more base damage."},{"ability":"Incendiary Grenade","energy":2,"castTime":0,"coeff":8.186300000000001,"text":"GTAoE: Affects up to 6 enemies in a 5 metre radius around the targeted point.Consumes 2 Assault Rifle Energy.\r\nLaunch a grenade filled with a highly potent mixture of thermite and anima dealing 1 physical damage to enemies in the targeted area. Affected targets are set on fire, are purged of 2 beneficial effects, and are dealt 1 damage every second for 8 seconds.\r\nIf the grenade is fully cooked before launch, the initial damage is improved to 4 physical damage and the damage over time effect is improved to deal 4 physical damage every second.\r\n\r\nRequires a grenade to activate.","passive":"Slow Burn","coeffPassove":10.028300000000002,"textPassive":"Your \"Incendiary Grenade\" is loaded with slower burning, longer lasting fuel, increasing the duration to 10 seconds."},{"ability":"Anima Canister","energy":2,"castTime":0,"text":"TAoE: Affects up to 6 friends in a 5 metre radius around the target.Consumes 2 Assault Rifle Energy.\r\nLaunch a canister of revitalizing anima at your target healing all nearby allies for 1. The healing energies also spread to your group, healing all group members for 1.\r\nIf the grenade is fully cooked before launch, the TAoE healing is improved to 1 and the group healing is improved to 1.\r\n\r\nRequires a grenade to activate.","passive":"Enlarged Canister","textPassive":"Your \"Anima Canister\" is expanded in size allowing you to load more anima energy. All group members healed by this ability will also gain a beneficial effect for 4 seconds which causes their attacks to heal them for a portion of the damage dealt."},{"ability":"Tactical Retreat","energy":2,"castTime":0,"text":"Column Dash: Dash backward 5 metres.Consumes 2 Assault Rifle Energy.\r\nPut some distance between you and your enemies by quickly moving backwards.\r\nIf you have a grenade, the dash distance is increased to 10 metres and the cooldown time is reduced to 4 seconds. This cooldown reduction can only happen once every 15 seconds.\r\nThe grenade is left at the start location, exploding 1 second after the dash, affecting up to 6 enemies and dealing 8 physical damage in an area around it. Affected targets have their movement speed slowed by 70% for 4 seconds.\r\nIf the grenade is fully cooked before the dash, the damage dealt is improved to 30 physical damage.","passive":"Withdrawal","textPassive":"Your \"Tactical Retreat\" grants you better positioning. When used you always dash 10 metres. In addition, when you leave a grenade the damage is increased to 7 physical damage or 20 physical damage for fully cooked grenades."},{"ability":"Essence Grenade","energy":2,"castTime":0,"coeff":1.637,"text":"TAoE: Affects up to 6 enemies and allies in a 5 metre radius around your target.Consumes 2 Assault Rifle Energy.\r\nLaunch a pair of grenades at the target, each one exploding in a burst of energy. One grenade deals 2 physical damage and applies Debilitated. The other grenade heals friendly targets for 1.\r\nIf the grenade is fully cooked before launch, the damage is improved to 7 physical damage and the healing is improved to 1.\r\n\r\nRequires a grenade to activate.","passive":"Lingering Essence","textPassive":"Your \"Essence Grenades\" leave a lingering mist of restorative energy, healing allies in the area for 1 every second for 5 seconds."},{"ability":"Vital Shot","energy":3,"text":"Consumes 3 Assault Rifle Energy.\r\nFire a draining blast of energy at your target dealing 4 physical damage. The drained energy heals your defensive target for 14 and additionally for 1.2% of the damage dealt.\r\nYou have a 37.5% chance to load a grenade when using this ability.","passive":"Bolstering Shot","textPassive":"Your \"Vital Shot\" bolsters your ally's energy, causing them to draw strength from their foes. For the next 4 seconds after being healed by this ability, your defensive target gains a beneficial effect which causes their attacks to restore their health."},{"ability":"Leeching Ray","energy":0,"castTime":0,"text":"Sap your target's energy with an enervating beam of energy from your rifle. This attack hits 3 times, dealing 3 physical damage per hit. A portion of the stolen energy heals your defensive target for 0.2% of the damage dealt. The remaining energy seeks out the member of your group with the lowest percentage remaining health and heals them for 7.\r\nRequires an Assault Rifle in your Primary Weapon slot.","passive":"-","coeffPassove":"-","textPassive":"-"},{"ability":"Unveil Essence","energy":5,"castTime":1,"text":"Consumes 5 Assault Rifle Energy.\r\nFire a bolt of energy at the target, revealing their inner essence for all to see. The target is dealt 4 physical damage and your group is healed for 14. The target's essence becomes available for any attackers to steal for 6 seconds causing everyone who attacks them to be healed for 0.1% of the damage dealt.\r\nYou have a 65% chance to load a grenade when using this ability.","passive":"Reap Essence","textPassive":"Unveil Essence reveals even more energy for your allies to reap. Whenever an attack critically hits a target affected by your \"Unveil Essence\" the attacker is instead healed for 0% of the damage they dealt."},{"ability":"Energise","energy":2,"castTime":0,"text":"Consumes 2 Assault Rifle Energy.\r\nTap into your inner energy, increasing the effectiveness of all Assault Rifle healing abilities by 24% for 6 seconds. During this time, all of your Assault Rifle attacks purge 1 beneficial effect from enemy targets. This ability does not trigger and is not affected by global recharge time.","passive":"Vivify","textPassive":"When you use \"Energise\" you awaken the latent energy in your group members. For the next 5 seconds, all healing effects on your group members are 5% more effective."},{"ability":"Red Mist","energy":4,"castTime":2,"coeff":6.97,"text":"Consumes 4 Assault Rifle Energy.\r\nTake aim at your target and fire a powerful shot at their vitals dealing 51 physical damage and slowing its movement.","passive":"Unerring Accuracy","coeffPassove":9.3398,"textPassive":"Your \"Red Mist\" always hits its mark. This ability can no longer glance or be evaded and critical hits deal 68% more damage."},{"ability":"High Explosive Grenade","energy":4,"castTime":0,"coeff":11.9,"text":"TAoE: Affects up to 6 enemies in a 5 metre radius around the target.Consumes 4 Assault Rifle Energy.\r\nBlast the target and nearby enemies with a powerful high explosive grenade dealing 34 physical damage. Applies Debilitated and affected targets are stunned for 3 seconds. Also the area at the targeted point erupts into flames that last 8 seconds. Every second it will deal 2 physical damage to up to 6 enemies in a 5 metre radius.\r\nIf the grenade is fully cooked before launch, the initial blast's damage is improved to 79 physical damage.\r\nRequires a grenade to activate.","passive":"Auto-loader","coeffPassove":"n/a","textPassive":"After launching your \"High Explosive Grenade\" your auto-loader kicks in, causing your next grenade generating ability to have a 100% chance to load a grenade."},{"ability":"Anima Suffusion","energy":4,"castTime":1.5,"coeff":5.25,"text":"Channelled: Every 0.3 seconds for 1.5 seconds.Consumes 4 Assault Rifle Energy.\r\nInfuse the target's entire being with anima, healing them for 4 each interval. While channeling this ability and for 2.5 seconds after, your target is unable to be killed. When this ability finishes channeling, you gain a beneficial effect which increases the effectiveness of all Assault Rifle healing abilities by 14% for 4 seconds.","passive":"Permeate","coeffPassove":"n/a","textPassive":"After using \"Anima Suffusion\" your target is left imbued with some anima residue, granting a beneficial effect for 4 seconds which causes their attacks to heal them for a portion of the damage dealt. The amount the target is healed for with each attack scales based on your Healing Power."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Anima-Tipped Bullets","textPassive":"Your bullets are infused with anima energy causing each Assault Rifle shot to heal you for 4% of the damage dealt."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Explosives Expert","textPassive":"Your skill with explosives allows you to increase the fuse time on your grenades to 9 seconds. Also, your grenades are now fully cooked when they have 6 seconds remaining before detonating. If a grenade detonates before you are able to launch it, you are no longer harmed by the blast and nearby enemies are dealt 2 physical damage."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Secondary Explosion","coeffPassove":0.9,"textPassive":"You pack additional timed explosives into your grenade abilities. These explosives detonate 1.5 seconds after you launch your grenade dealing 2 physical damage to enemies within 2 metres of the original target."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Backup Plan","textPassive":"You always have a plan when dealing with your explosives. If you were to load a grenade while one is already cooking, you gain a beneficial effect which increases your Assault Rifle damage by 10% for 4 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Emergency Loader","textPassive":"Your experience with volatile explosives allows you to act calm under pressure. Whenever you are below 85% health, your chance to load grenades is increased to 45% when using \"Full Auto\" or \"Vital Shot\" and 80% when using \"Burst Fire\" or \"Unveil Essence.\""},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Field Medic","textPassive":"Your presence empowers the restorative effects of your Assault Rifle abilities. If you are within 7 metres of your defensive target when healing with your Assault Rifle, they are healed for an additional 1."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Ground Marker Rounds","textPassive":"Your grenades are loaded with a restorative mist. After launching any grenade, allies standing in the blast area are healed for 1 every second for 5 seconds."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Jungle Style","textPassive":"You come prepared with extra ammunition. Whenever you run out of Assault Rifle Energy, you gain 1 Assault Rifle Energy."},{"ability":"-","energy":"-","castTime":"-","coeff":"-","text":"-","passive":"Anima Dispersal","textPassive":"Whenever you launch a grenade, you harness some of the expended energy into restorative power. For the next 5 seconds, all of your healing and leeching effects are 6.5% more effective."}]